chore: init project structure
